public/about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="nil" xml:lang="nil">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reed Shipley Resume</title>
<meta name="author" content="Reed" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="preamble" class="status">
<div class='topnav'>
                                      <a href='/portfolio.html'>Home</a> /
                                      <a href='/writing.html'>Writing</a> /
                                      <a href='/about.html'>About Me</a>
                                      </div>
</div>
<div id="content" class="content">
<h1 class="title">Reed Shipley Resume</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org03db4d2">APPLICATION PROGRAMMING INTERFACE (API) | BACK-END DEVELOPMENT</a>
<ul>
<li><a href="#org71f1170">Summary</a></li>
</ul>
</li>
<li><a href="#orgbb780dc">TECHNICAL SKILLS</a></li>
<li><a href="#orgdf16e09">Professional Experience</a>
<ul>
<li><a href="#org9f15d33">Animal Care Technologies, Denton, TX</a></li>
<li><a href="#orgf2258d5">Shipley Labs LLC, Evergreen, CO</a></li>
<li><a href="#orgfc8a5e5">Dave, Remote</a></li>
<li><a href="#orgfdbe041">Oddball, Remote</a></li>
<li><a href="#orgbde3f13">Active Cyber, Remote</a></li>
<li><a href="#orgedc855a">IBM, Remote, Dallas, TX</a></li>
<li><a href="#org5b15b0f">Texas Army National Guard, Texas</a></li>
</ul>
</li>
<li><a href="#org9d06680">EDUCATION AND TRAINING</a></li>
<li><a href="#org9cafdab">TECHNICAL CERTIFICATIONS</a>
<ul>
<li><a href="#org98a7e6e">Interesting Projects</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org03db4d2" class="outline-2">
<h2 id="org03db4d2">APPLICATION PROGRAMMING INTERFACE (API) | BACK-END DEVELOPMENT</h2>
<div class="outline-text-2" id="text-org03db4d2">
</div>

<div id="outline-container-org71f1170" class="outline-3">
<h3 id="org71f1170">Summary</h3>
<div class="outline-text-3" id="text-org71f1170">
<p>
5+ years of progressive experience building comprehensive back-end solutions and navigating integration roadblocks, analyzing raw data to develop actionable steps that provide scalable and automated support. Structures substantive development across the full life cycle with multi-faceted skills and a history of working with enterprise clients, internal teams, startups, financial institutions, and government partners.
</p>

<p>
A document version of this resume can be downloaded <a href="file:///Users/reed/dev/org-portfolio/assets/Reed Shipley resume.docx">here</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbb780dc" class="outline-2">
<h2 id="orgbb780dc">TECHNICAL SKILLS</h2>
<div class="outline-text-2" id="text-orgbb780dc">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b><b>Category</b></b></th>
<th scope="col" class="org-left"><b><b>Tools/Technologies</b></b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Languages</td>
<td class="org-left">.NET, Ruby, Javascript, Typescript, Python, Java, C#, HTML/CSS</td>
</tr>

<tr>
<td class="org-left">Frameworks</td>
<td class="org-left">Rails, React, .NET, Express, Sass, Material-UI</td>
</tr>

<tr>
<td class="org-left">Version Control</td>
<td class="org-left">Git, Github, Gitlab, Bitbucket, Codecloud, SVN</td>
</tr>

<tr>
<td class="org-left">Cloud/DevOps</td>
<td class="org-left">Docker, Docker-Compose, Kubernetes, Red Hat OpenShift, AWS S3</td>
</tr>

<tr>
<td class="org-left">Testing</td>
<td class="org-left">JUnit, RSpec, Jest, Postman, Selenium</td>
</tr>

<tr>
<td class="org-left">Databases</td>
<td class="org-left">MSSQL, MySQL, PostgreSQL, SQLite, MongoDB, Firebase</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgdf16e09" class="outline-2">
<h2 id="orgdf16e09">Professional Experience</h2>
<div class="outline-text-2" id="text-orgdf16e09">
</div>
<div id="outline-container-org9f15d33" class="outline-3">
<h3 id="org9f15d33">Animal Care Technologies, Denton, TX</h3>
<div class="outline-text-3" id="text-org9f15d33">
<p>
<b>SOFTWARE ENGINEER</b>
(4/2023 – Present)
</p>
<ul class="org-ul">
<li>Worked with clients and stakeholders as a Full-Stack Engineer on a data-conversion tool for Veterinary Offices. Collaborated across software teams to create internal tools and documentation to modernize workflow for both developers and support.</li>
<li>Researched and reverse-engineered database schemas and operations for data-quality efforts.</li>
<li>Built automation scripts and internal tools to improve developer efficiency.</li>
<li>Troubleshot client issues with our software to assist tech-support on escalated tickets.</li>
<li>Maintained and improved .NET software product to meet client needs.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2258d5" class="outline-3">
<h3 id="orgf2258d5">Shipley Labs LLC, Evergreen, CO</h3>
<div class="outline-text-3" id="text-orgf2258d5">
<p>
<b>FOUNDER | LEAD SOFTWARE ENGINEER</b>
(3/2022 – 4/2023)
</p>
<ul class="org-ul">
<li>Strategized opportunities to consult for enterprise clients in back-end and API development projects within different frameworks. Responsible for leading stakeholder communications with extensive project planning, resource management, and cross-functional coordination.</li>
<li>Worked on green-field and legacy projects to streamline scalability and scope of the product.</li>
<li>Created software solutions for startup clients from conceptualization to implementation, managing development across the full life cycle.</li>
<li>Handled all business logistics including client meetings, bidding, negotiations, road-mapping, implementation, user documentation, and delivery.</li>
<li>Managed sub-contractors to ensure delivery to stakeholders.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfc8a5e5" class="outline-3">
<h3 id="orgfc8a5e5">Dave, Remote</h3>
<div class="outline-text-3" id="text-orgfc8a5e5">
<p>
<b>SOFTWARE ENGINEER</b>
(7/2021 – 3/2022)
</p>
<ul class="org-ul">
<li>Performed back-end improvements for a fin-tech startup, refining products primarily in Typescript with feature improvements, modernization of existing codebase, and increased scalability. Tested and signed off on all changes to prepare the company for initial public offering.</li>
<li>Developed internal and external API to deliver promotions for existing banking products, refactoring existing space to improve scalability.</li>
<li>Refined CI/CD pipeline to streamline software delivery, testing, and automation.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfdbe041" class="outline-3">
<h3 id="orgfdbe041">Oddball, Remote</h3>
<div class="outline-text-3" id="text-orgfdbe041">
<p>
<b>SOFTWARE ENGINEER</b>
(7/2020 – 7/2021)
</p>
<ul class="org-ul">
<li>Led technical initiatives in Typescript and Ruby on Rails for the Department of Veteran’s Affairs API platform, designing and implementing green field development. Consulted with senior stakeholders to develop technical specifications, build teams, provide updates, and coordinate execution procedures.</li>
<li>Enhanced business development process as a Subject Matter Expert (SME) and reviewer for a government contract proposal, earning project approval for $40MM initiative.</li>
<li>Established a cross-functional team of eight new hires, interviewing, onboarding, and training staff.</li>
<li>Led research groundwork for VA project to evaluate legacy platform as one of four contributors to a 100-page white paper.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbde3f13" class="outline-3">
<h3 id="orgbde3f13">Active Cyber, Remote</h3>
<div class="outline-text-3" id="text-orgbde3f13">
<p>
<b>SENIOR FULL STACK DEVELOPER</b>
(3/2020 – 7/2020) (COVID-IMPACTED)
</p>
<ul class="org-ul">
<li>Recruited by CTO after IBM contract was fulfilled to customize development for Okta Customer Identity Management integration, including API structure, containerization, and modernization. Contributed to team onboarding and training for three successive members.</li>
<li>Enhanced back-end production code in a variety of languages and frameworks based on client needs.</li>
<li>Accumulated additional skills in front-end development with a new pipeline of projects coming in weekly.</li>
</ul>
</div>
</div>

<div id="outline-container-orgedc855a" class="outline-3">
<h3 id="orgedc855a">IBM, Remote, Dallas, TX</h3>
<div class="outline-text-3" id="text-orgedc855a">
<p>
<b>APPLICATION DEVELOPER, CLOUD MICROSERVICES</b>
(6/2019 – 3/2020)
</p>
<ul class="org-ul">
<li>Contributed to backend development of major enterprise software systems for key businesses on large multi-functional teams. Utilized Java 8, Maven, SpringBoot, SQL, Hibernate, JUnit, Oracle DB, and green field development to generate and automate reports.</li>
<li>Assigned to a federal financial project valued at over $10B.</li>
<li>Played a key role in modernization, microservice development, and production support.</li>
</ul>
</div>
</div>

<div id="outline-container-org5b15b0f" class="outline-3">
<h3 id="org5b15b0f">Texas Army National Guard, Texas</h3>
<div class="outline-text-3" id="text-org5b15b0f">
<p>
<b>SERGEANT</b>
(3/2011 – 3/2017)
</p>
<ul class="org-ul">
<li>Fire Direction Center Chief of a Battalion mortar platoon directing analysis of weather, personnel training, and combat precision requirements. Trained soldiers in job duties and oversaw day to day operations. Promoted to Non-Commissioned Officer ahead of peers at 3.5 years of service.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9d06680" class="outline-2">
<h2 id="org9d06680">EDUCATION AND TRAINING</h2>
<div class="outline-text-2" id="text-org9d06680">
<ul class="org-ul">
<li>Rockwall-Heath High School Diploma, Heath, TX</li>
</ul>
</div>
</div>

<div id="outline-container-org9cafdab" class="outline-2">
<h2 id="org9cafdab">TECHNICAL CERTIFICATIONS</h2>
<div class="outline-text-2" id="text-org9cafdab">
<ul class="org-ul">
<li>Okta Certified Professional, Okta – 2020</li>
<li>Certified Specialist in OpenShift Application Development, Red Hat – 2019</li>
<li>Web Development Certificate, Dev Mountain, Dallas, TX – 2019</li>
</ul>
</div>


<div id="outline-container-org98a7e6e" class="outline-3">
<h3 id="org98a7e6e">Interesting Projects</h3>
<div class="outline-text-3" id="text-org98a7e6e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Link 1</th>
<th scope="col" class="org-left">Link 2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Todos</b></td>
<td class="org-left">An NPM package for managing and reporting 'TODO' comments in software projects</td>
<td class="org-left"><a href="https://www.npmjs.com/package/@shipleylabs/todos">NPM Package</a></td>
<td class="org-left"><a href="https://github.com/reedship/todos_node">Github Repo</a></td>
</tr>

<tr>
<td class="org-left"><b>SimpleOkta</b></td>
<td class="org-left">An open-source HTTP gem for common Okta API calls</td>
<td class="org-left"><a href="https://rubygems.org/gems/simpleokta">RubyGems Source</a></td>
<td class="org-left"><a href="https://github.com/reedship/simpleokta">Github Repo</a></td>
</tr>

<tr>
<td class="org-left"><b>PPP5</b></td>
<td class="org-left">A Full Stack Pair Programming application for the P5.js library</td>
<td class="org-left"><a href="https://www.youtube.com/embed/N95z3fSR3jY">Video Walkthrough</a></td>
<td class="org-left"><a href="https://github.com/reedship/ppp5">Github Repo</a></td>
</tr>

<tr>
<td class="org-left"><b>Magic: The Deck Builder</b></td>
<td class="org-left">A small-scale application built in React to interact with the Magic API</td>
<td class="org-left"><a href="https://www.youtube.com/embed/Mm0UnK66378">Video Walkthrough</a></td>
<td class="org-left"><a href="https://github.com/reedship/mtdb">Github Repo</a></td>
</tr>

<tr>
<td class="org-left"><b>Ordeer</b></td>
<td class="org-left">A Full Stack Restaurant Ordering Application</td>
<td class="org-left"><a href="https://www.youtube.com/embed/B5NUT5Hejf0">Video Walkthrough</a></td>
<td class="org-left"><a href="https://github.com/restaurant-ordering/Ordeer">Github Repo</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Reed</p>
</div>
</body>
</html>
